The  IFrameworkElementCreator  type exposes the following members.
 Methods
Name  |   Description
CreateFrameworkElement
 Method called to create the FrameworkElement.
 See Also
  IFrameworkElementCreator Interface
  Autodesk.Revit.UI Namespace